# IFC_DMGetEntriesCnt

## Description
Gets the count of entries for indicated object from current IFC Data Mapping.

```pascal
FUNCTION IFC_DMGetEntriesCnt(
				inStrObjName : STRING;
				VAR outCount : INTEGER) : BOOLEAN;
```

```python

def vs.IFC_DMGetEntriesCnt(inStrObjName):
    return (BOOLEAN, outCount)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inStrObjName|STRING||
|outCount|INTEGER||

## Version
Availability: from Vectorworks 2017
## Category
* IFC